Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX5112MTSH128.atdf
      <value-group caption="External Clock Selection" name="ADC_EMR__SRCCLK">
        <value caption="The peripheral clock is the source for the ADC prescaler." name="PERIPH_CLK" value="0"/>
        <value caption="GCLK is the source clock for the ADC prescaler, thus the ADC clock can be independent of the core/peripheral clock." name="GCLK" value="1"/>
      </value-group>
      <value-group caption="Tracking Time x4, x8 or x16" name="ADC_EMR__TRACKX">
        <value caption="ADC_MR.TRACKTIM effect is multiplied by 1." name="TRACKTIMX1" value="0x0"/>
        <value caption="ADC_MR.TRACKTIM effect is multiplied by 4." name="TRACKTIMX4" value="0x1"/>
        <value caption="ADC_MR.TRACKTIM effect is multiplied by 8" name="TRACKTIMX8" value="0x2"/>
        <value caption="ADC_MR.TRACKTIM effect is multiplied by 16." name="TRACKTIMX16" value="0x3"/>
      </value-group>
      <value-group caption="Sign Mode" name="ADC_EMR__SIGNMODE">
        <value caption="Single-ended channels: unsigned conversions Differential channels: signed conversions" name="SE_UNSG_DF_SIGN" value="0x0"/>
        <value caption="Single-ended channels: signed conversions Differential channels: unsigned conversions" name="SE_SIGN_DF_UNSG" value="0x1"/>
        <value caption="All channels: unsigned conversions" name="ALL_UNSIGNED" value="0x2"/>
        <value caption="All channels: signed conversions" name="ALL_SIGNED" value="0x3"/>
      </value-group>
      <value-group caption="ADC Running Mode" name="ADC_EMR__ADCMODE">
        <value caption="Normal mode of operation." name="NORMAL" value="0x0"/>
        <value caption="Offset Error mode to measure the offset error. See Table 6-6 &quot;ADC Running Modes&quot;." name="OFFSET_ERROR" value="0x1"/>
        <value caption="Gain Error mode to measure the gain error. See Table 6-6 &quot;ADC Running Modes&quot;." name="GAIN_ERROR_HIGH" value="0x2"/>
        <value caption="Gain Error mode to measure the gain error. See Table 6-6 &quot;ADC Running Modes&quot;." name="GAIN_ERROR_LOW" value="0x3"/>
      </value-group>
      <value-group caption="Write Protection Key" name="ADC_PWPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation. Always reads as 0." name="PASSWD" value="0x504443"/>
      </value-group>
      <value-group name="ADC_FMR__ENFIFO">
        <value name="0" caption="FIFO is disabled." value="0"/>
        <value name="1" caption="FIFO is enabled." value="1"/>
      </value-group>
      <value-group name="ADC_FMR__ENLEVEL">
        <value name="0" caption="Request to DMA is generated as soon as one data is written in FIFO when FIFO is enabled. CHUNK is not used." value="0"/>
        <value name="1" caption="Request to DMA is generated as soon as the number of written elements in the FIFO is greater than or equal to CHUNK." value="1"/>
      </value-group>
      <value-group caption="Trigger Mode" name="ADC_TRGR__TRGMOD">
        <value caption="No hardware trigger, only software trigger can start conversions" name="NO_TRIGGER" value="0x0"/>
        <value caption="Rising edge of the selected trigger event, defined in ADC_MR.TRGSEL" name="EXT_TRIG_RISE" value="0x1"/>
        <value caption="Falling edge of the selected trigger event" name="EXT_TRIG_FALL" value="0x2"/>
        <value caption="Any edge of the selected trigger event" name="EXT_TRIG_ANY" value="0x3"/>
        <value caption="ADC internal periodic trigger (see TRGPER)" name="PERIOD_TRIG" value="0x5"/>
        <value caption="Continuous mode, free run mode" name="CONTINUOUS" value="0x6"/>
      </value-group>
      <value-group caption="Write Protection Key" name="ADC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x414443"/>
      </value-group>
    </module>
    <module caption="Advanced Encryption Standard" name="AES" id="6149" version="ZN">
      <register-group name="AES">
        <register caption="Control Register" name="AES_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Start Processing" mask="0x00000001" name="START"/>
          <bitfield caption="Key Swap" mask="0x00000002" name="KSWP"/>
          <bitfield caption="Software Reset" mask="0x00000100" name="SWRST"/>
          <bitfield caption="Unlock Processing" mask="0x01000000" name="UNLOCK"/>
        </register>
        <register caption="Mode Register" name="AES_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Processing Mode" mask="0x00000001" name="CIPHER"/>
          <bitfield caption="GCM Automatic Tag Generation Enable" mask="0x00000002" name="GTAGEN"/>
          <bitfield caption="Dual Input Buffer" mask="0x00000008" name="DUALBUFF" values="AES_MR__DUALBUFF"/>
          <bitfield caption="Processing Delay" mask="0x000000F0" name="PROCDLY"/>
          <bitfield caption="Start Mode" mask="0x00000300" name="SMOD" values="AES_MR__SMOD"/>
          <bitfield caption="Key Size" mask="0x00000C00" name="KEYSIZE" values="AES_MR__KEYSIZE"/>
          <bitfield caption="Operating Mode" mask="0x00007000" name="OPMOD" values="AES_MR__OPMOD"/>
          <bitfield caption="Last Output Data Mode" mask="0x00008000" name="LOD"/>
          <bitfield caption="Cipher Feedback Data Size" mask="0x00070000" name="CFBS" values="AES_MR__CFBS"/>
          <bitfield caption="Key" mask="0x00F00000" name="CKEY" values="AES_MR__CKEY"/>
          <bitfield caption="Tamper Clear Enable" mask="0x80000000" name="TAMPCLR"/>
        </register>
        <register caption="Interrupt Enable Register" name="AES_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x00000002" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Enable" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x00000008" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable" mask="0x00000010" name="TXBUFE"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Enable" mask="0x00000100" name="URAD"/>
          <bitfield caption="GCM Tag Ready Interrupt Enable" mask="0x00010000" name="TAGRDY"/>
          <bitfield caption="End of Padding Interrupt Enable" mask="0x00020000" name="EOPAD"/>
          <bitfield caption="Padding Length Error Interrupt Enable" mask="0x00040000" name="PLENERR"/>
          <bitfield caption="Security and/or Safety Event Interrupt Enable" mask="0x00080000" name="SECE"/>
        </register>
