Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX5112MTSH128.atdf
        <register caption="SMULB Register" name="CPKCC_SMULB" offset="0x20" rw="RW" size="4">
          <bitfield caption="CPKCC_SMULB value" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
        <register caption="SMULRL Register" name="CPKCC_SMULRL" offset="0x24" rw="RW" size="4">
          <bitfield caption="CPKCC_SMULRL value" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
        <register caption="SMULRH Register" name="CPKCC_SMULRH" offset="0x28" rw="RW" size="4">
          <bitfield caption="CPKCC_SMULRH value" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
        <register caption="IDLE Register" name="CPKCC_IDLE" offset="0x2C" rw="RW" size="1">
          <bitfield caption="CPKCC_IDLE value" mask="0x000000FF" name="VALUE"/>
        </register>
        <register caption="IDLECACHE Register" name="CPKCC_IDLECACHE" offset="0x2D" rw="RW" size="1">
          <bitfield caption="CPKCC_IDLECACHE value" mask="0x000000FF" name="VALUE"/>
        </register>
        <register caption="CR_C Register" name="CPKCC_CR_C" offset="0x30" rw="RW" size="4">
          <bitfield caption="CPKCC_CR_C value" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
        <register caption="CR_S Register" name="CPKCC_CR_S" offset="0x34" rw="RW" size="4">
          <bitfield caption="CPKCC_CR_S value" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
        <register caption="CR Register" name="CPKCC_CR" offset="0x38" rw="RW" size="4">
          <bitfield caption="GF(2n) mode" mask="0x00000001" name="GF2N"/>
          <bitfield caption="CARRYIN value" mask="0x00000002" name="CARRYIN"/>
          <bitfield caption="ONEMUL value" mask="0x00000004" name="ONEMUL"/>
          <bitfield caption="ABORT value" mask="0x00000008" name="ABORT"/>
          <bitfield caption="Spill Word register bit" mask="0x00000010" name="SPILLW"/>
          <bitfield caption="AWAKE value" mask="0x00000020" name="AWAKE"/>
          <bitfield caption="CPKCC_IRQ value" mask="0x00000040" name="PKCCIRQ"/>
          <bitfield caption="ITEN value" mask="0x00000080" name="ITEN"/>
          <bitfield caption="CLRRAM value" mask="0x00000100" name="CLRRAM"/>
          <bitfield caption="CPKCC_CR value" mask="0xFFFFFE00" name="VALUE"/>
        </register>
        <register caption="Operation Register" name="CPKCC_OR" offset="0x3C" rw="RW" size="4">
          <bitfield caption="CMD0 value" mask="0x00000001" name="CMD0"/>
          <bitfield caption="CMD1 value" mask="0x00000002" name="CMD1"/>
          <bitfield caption="CMD2 value" mask="0x00000004" name="CMD2"/>
          <bitfield caption="CMD3 value" mask="0x00000008" name="CMD3"/>
          <bitfield caption="OPTM0 value" mask="0x00000010" name="OPTM0"/>
          <bitfield caption="OPTM1 value" mask="0x00000020" name="OPTM1"/>
          <bitfield caption="OPTC0 value" mask="0x00000040" name="OPTC0"/>
          <bitfield caption="OPTC1 value" mask="0x00000080" name="OPTC1"/>
          <bitfield caption="CARRYMUL value" mask="0x00000400" name="CARRYMUL"/>
          <bitfield caption="CPKCC_OR value" mask="0xFFFFF800" name="VALUE"/>
        </register>
        <register caption="SR Register" name="CPKCC_SR" offset="0x40" rw="RW" size="4">
          <bitfield caption="BUSY value" mask="0x00000001" name="BUSY"/>
          <bitfield caption="CACHE value" mask="0x00000002" name="CACHE"/>
          <bitfield caption="CARRY value" mask="0x00000004" name="CARRY"/>
          <bitfield caption="ZERO value" mask="0x00000008" name="ZERO"/>
          <bitfield caption="RAM violation" mask="0x00000010" name="RAMV"/>
          <bitfield caption="SHAREV value" mask="0x00000020" name="SHAREV"/>
          <bitfield caption="CLRRAM_BUSY value" mask="0x00000040" name="CLRRAM_BUSY"/>
          <bitfield caption="CPKCC_SR value" mask="0xFFFFFF80" name="VALUE"/>
        </register>
        <register caption="ADDRSIZE Register" name="CPKCC_ADDRSIZE" offset="0xEC" rw="RW" size="4">
          <bitfield caption="CPKCC_ADDRSIZE value" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
        <register caption="IPNAME1 Register" name="CPKCC_IPNAME" offset="0xF0" rw="RW" size="4" count="2">
          <bitfield caption="CPKCC_IPNAME1 value" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
        <register caption="FEATURES Register" name="CPKCC_FEATURES" offset="0xF8" rw="RW" size="4">
          <bitfield caption="CPKCC_FEATURES value" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
      </register-group>
    </module>
    <module caption="Dual Watchdog Timer" name="DWDT" id="04686" version="C">
      <register-group name="DWDT">
        <register caption="Watchdog 1 Control Register" name="WDT1_CR" offset="0x0000" rw="W" size="4">
          <bitfield caption="Watchdog Restart" mask="0x00000001" name="WDRSTT"/>
          <bitfield caption="Lock Mode Register Write Access" mask="0x00000010" name="LOCKMR"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY" values="WDT1_CR__KEY"/>
        </register>
        <register caption="Watchdog 1 Mode Register" name="WDT1_MR" offset="0x0004" rw="RW" size="4">
          <bitfield caption="Watchdog Overflow Period Reset Enable" mask="0x00000010" name="PERIODRST"/>
          <bitfield caption="Repeat Threshold Reset Enable" mask="0x00000020" name="RPTHRST"/>
          <bitfield caption="Watchdog Reset NRST Pin Disable" mask="0x00000200" name="WDNRSTDIS"/>
          <bitfield caption="Watchdog Disable" mask="0x00001000" name="WDDIS"/>
          <bitfield caption="Watchdog Idle Halt" mask="0x10000000" name="WDIDLEHLT"/>
          <bitfield caption="Watchdog Core 0 Debug Halt" mask="0x20000000" name="WDDBG0HLT"/>
          <bitfield caption="Watchdog Core 1 Debug Halt" mask="0x40000000" name="WDDBG1HLT"/>
        </register>
        <register caption="Watchdog 1 Value Register" name="WDT1_VR" offset="0x0008" rw="R" size="4">
          <bitfield caption="Watchdog Down Counter Value" mask="0x00000FFF" name="COUNTER"/>
        </register>
        <register caption="Watchdog 1 Window Level Register" name="WDT1_WL" offset="0x000C" rw="RW" size="4">
          <bitfield caption="Watchdog Period" mask="0x00000FFF" name="PERIOD"/>
          <bitfield caption="Repeat Threshold" mask="0x0FFF0000" name="RPTH"/>
        </register>
        <register caption="Watchdog 1 Interrupt Level Register" name="WDT1_IL" offset="0x0010" rw="RW" size="4">
          <bitfield caption="Level Threshold" mask="0x00000FFF" name="LVLTH"/>
          <bitfield caption="Prescaler Ratio" mask="0x00070000" name="PRESC" values="WDT1_IL__PRESC"/>
        </register>
        <register caption="Watchdog 1 Interrupt Enable Register" name="WDT1_IER" offset="0x0014" rw="W" size="4">
          <bitfield caption="Overflow Period Interrupt Enable" mask="0x00000001" name="PERINT"/>
          <bitfield caption="Reload Repeat Period Interrupt Enable" mask="0x00000002" name="RPTHINT"/>
          <bitfield caption="Interrupt Level Threshold Interrupt Enable" mask="0x00000004" name="LVLINT"/>
          <bitfield caption="Reload Command Error Interrupt Enable" mask="0x00000020" name="RLDERR"/>
        </register>
