Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX5112MTSH128.atdf
      <value-group caption="Password" name="WDT1_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="Prescaler Ratio" name="WDT1_IL__PRESC">
        <value caption="The watchdog counter decreased when the prescaler reaches 128." name="RATIO128" value="0x0"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 64." name="RATIO64" value="0x1"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 32." name="RATIO32" value="0x2"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 16." name="RATIO16" value="0x3"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 8." name="RATIO8" value="0x4"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 4." name="RATIO4" value="0x5"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 2." name="RATIO2" value="0x6"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 1." name="RATIO1" value="0x7"/>
      </value-group>
      <value-group caption="Password" name="WDT0_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="Prescaler Ratio" name="WDT0_IL__PRESC">
        <value caption="The watchdog counter decreased when the prescaler reaches 128." name="RATIO128" value="0x0"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 64." name="RATIO64" value="0x1"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 32." name="RATIO32" value="0x2"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 16." name="RATIO16" value="0x3"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 8." name="RATIO8" value="0x4"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 4." name="RATIO4" value="0x5"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 2." name="RATIO2" value="0x6"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 1." name="RATIO1" value="0x7"/>
      </value-group>
    </module>
    <module caption="Energy Metering Analog Front End" name="EMAFE" id="04742" version="C">
      <register-group name="EMAFE">
        <register caption="Control Register" name="EMAFE_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
          <bitfield caption="Sinc Decimation Filters Reset" mask="0x00000002" name="SWRST_DECIM"/>
        </register>
        <register caption="Mode Register" name="EMAFE_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Low-Pass Filter 0 On" mask="0x00000001" name="LPF_ON0"/>
          <bitfield caption="Low-Pass Filter 1 On" mask="0x00000002" name="LPF_ON1"/>
          <bitfield caption="Low-Pass Filter 2 On" mask="0x00000004" name="LPF_ON2"/>
          <bitfield caption="Low-Pass Filter 3 On" mask="0x00000008" name="LPF_ON3"/>
          <bitfield caption="Low-Pass Filter 4 On" mask="0x00000010" name="LPF_ON4"/>
          <bitfield caption="Direct Memory Access On" mask="0x00000080" name="DMA_ON"/>
          <bitfield caption="Channel 0 Enable for DMA transfer" mask="0x00000100" name="DMACH0"/>
          <bitfield caption="Channel 1 Enable for DMA transfer" mask="0x00000200" name="DMACH1"/>
          <bitfield caption="Channel 2 Enable for DMA transfer" mask="0x00000400" name="DMACH2"/>
          <bitfield caption="Channel 3 Enable for DMA transfer" mask="0x00000800" name="DMACH3"/>
          <bitfield caption="Channel 4 Enable for DMA transfer" mask="0x00001000" name="DMACH4"/>
          <bitfield caption="Variation Detection On" mask="0x00008000" name="VAR_ON"/>
          <bitfield caption="Variation Detection Channel Selection" mask="0x00070000" name="VAR_CH" values="EMAFE_MR__VAR_CH"/>
          <bitfield caption="Variation Detection Limit for Event Triggering" mask="0x3FF00000" name="VAR_LIMIT"/>
        </register>
        <register caption="Channels Difference Comparison Register" name="EMAFE_CDCR" offset="0x08" rw="RW" size="4">
          <bitfield caption="First Channel to Compare" mask="0x00000007" name="CHA_IDX" values="EMAFE_CDCR__CHA_IDX"/>
          <bitfield caption="Second Channel to Compare" mask="0x00000070" name="CHB_IDX" values="EMAFE_CDCR__CHB_IDX"/>
          <bitfield caption="Type of Comparison" mask="0x00000100" name="DIFFTYPE"/>
          <bitfield caption="Successive Comparison Event Count" mask="0x0000F000" name="DIFFCOUNT"/>
          <bitfield caption="Threshold" mask="0x0FFF0000" name="DIFFTHRES"/>
        </register>
        <register caption="Extended Mode Register" name="EMAFE_EMR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Data Format" mask="0x00000003" name="FORMAT" values="EMAFE_EMR__FORMAT"/>
          <bitfield caption="LPF Clock Prescaler Ratio" mask="0x000000F0" name="MCLKDIV_LPF" values="EMAFE_EMR__MCLKDIV_LPF"/>
          <bitfield caption="OSR of the Decimation Filters" mask="0x00000700" name="OSR" values="EMAFE_EMR__OSR"/>
        </register>
        <register caption="DMA Data Register" name="EMAFE_DMA_DATA" offset="0x10" rw="R" size="4">
          <mode name="CH_INDEX_24BIT_DATA"/>
          <mode name="ONLY_32BIT_DATA_SE24BIT"/>
          <mode name="ONLY_32BIT_DATA"/>
          <bitfield caption="24-bit Data read by DMA" mask="0x00FFFFFF" name="DATA24" modes="CH_INDEX_24BIT_DATA"/>
          <bitfield caption="Channel Index" mask="0xFF000000" name="CHIDX" modes="CH_INDEX_24BIT_DATA"/>
          <bitfield caption="Low-pass Filter 24-bit Data with 32-bit Sign Extension read by DMA" mask="0xFFFFFFFF" name="DATA24SE" modes="ONLY_32BIT_DATA_SE24BIT"/>
          <bitfield caption="32-bit Data read by DMA" mask="0xFFFFFFFF" name="DATA32" modes="ONLY_32BIT_DATA"/>
        </register>
        <register caption="Data Channel 0 Register" name="EMAFE_DATA" offset="0x14" rw="R" size="4" count="5">
          <mode name="DATA_24BIT"/>
          <mode name="SE_24BIT_DATA"/>
          <mode name="DATA_32BIT"/>
          <bitfield caption="Low-pass Filter 24-bit Signed Data" mask="0x00FFFFFF" name="DATA24" modes="DATA_24BIT"/>
          <bitfield caption="Low-pass Filter 24-bit Data with 32-bit Sign Extension" mask="0xFFFFFFFF" name="DATA24SE" modes="SE_24BIT_DATA"/>
          <bitfield caption="Low-pass Filter 32-bit Signed Data" mask="0xFFFFFFFF" name="DATA32" modes="DATA_32BIT"/>
        </register>
        <register caption="Channel A Comparison Configuration 1" name="EMAFE_CHA_CFG1" offset="0x40" rw="RW" size="4">
          <bitfield caption="Threshold 1 for Channel A" mask="0x00FFFFFF" name="THRESH1"/>
          <bitfield caption="Channel A Index" mask="0x07000000" name="IDX" values="EMAFE_CHA_CFG1__IDX"/>
          <bitfield caption="Condition Applied for Detection on Channel A" mask="0x20000000" name="COND" values="EMAFE_CHA_CFG1__COND"/>
        </register>
        <register caption="Channel B Comparison Configuration 1" name="EMAFE_CHB_CFG1" offset="0x44" rw="RW" size="4">
          <bitfield caption="Threshold 1 for Channel B" mask="0x00FFFFFF" name="THRESH1"/>
          <bitfield caption="Channel B Index" mask="0x07000000" name="IDX" values="EMAFE_CHB_CFG1__IDX"/>
          <bitfield caption="Condition Applied for Detection on Channel B" mask="0x20000000" name="COND" values="EMAFE_CHB_CFG1__COND"/>
        </register>
