Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX5112MTSH128.atdf
        <register caption="TWI FIFO Interrupt Enable Register" name="FLEX_TWI_FIER" offset="0x664" rw="W" size="4">
          <bitfield caption="TXFEF Interrupt Enable" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Enable" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Enable" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Enable" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Enable" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Enable" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Enable" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Enable" mask="0x00000080" name="RXFPTEF"/>
        </register>
        <register caption="TWI FIFO Interrupt Disable Register" name="FLEX_TWI_FIDR" offset="0x668" rw="W" size="4">
          <bitfield caption="TXFEF Interrupt Disable" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Disable" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Disable" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Disable" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Disable" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Disable" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Disable" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Disable" mask="0x00000080" name="RXFPTEF"/>
        </register>
        <register caption="TWI FIFO Interrupt Mask Register" name="FLEX_TWI_FIMR" offset="0x66C" rw="R" size="4">
          <bitfield caption="TXFEF Interrupt Mask" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Mask" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Mask" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Mask" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Mask" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Mask" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Mask" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Mask" mask="0x00000080" name="RXFPTEF"/>
        </register>
        <register caption="TWI Write Protection Mode Register" name="FLEX_TWI_WPMR" offset="0x6E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Control Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="FLEX_TWI_WPMR__WPKEY"/>
        </register>
        <register caption="TWI Write Protection Status Register" name="FLEX_TWI_WPSR" offset="0x6E8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status (cleared on read)" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0xFFFFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="FLEXCOM Operating Mode" name="FLEX_MR__OPMODE">
        <value caption="No communication" name="NO_COM" value="0x0"/>
        <value caption="All UART related protocols are selected (RS232, RS485, IrDA, ISO7816, LIN,) SPI/TWI related registers are not accessible and have no impact on IOs." name="USART" value="0x1"/>
        <value caption="SPI operating mode is selected. USART/TWI related registers are not accessible and have no impact on IOs." name="SPI" value="0x2"/>
        <value caption="All TWI related protocols are selected (TWI, SMBus). USART/SPI related registers are not accessible and have no impact on IOs." name="TWI" value="0x3"/>
      </value-group>
      <value-group caption="Write Protection Key" name="FLEX_PWPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation. Always reads as 0." name="PASSWD" value="0x504443"/>
      </value-group>
      <value-group caption="USART Mode of Operation" name="FLEX_US_MR__USART_MODE">
        <value caption="Normal mode" name="NORMAL" value="0x0"/>
        <value caption="RS485" name="RS485" value="0x1"/>
        <value caption="Hardware handshaking" name="HW_HANDSHAKING" value="0x2"/>
        <value caption="IS07816 Protocol: T = 0" name="IS07816_T_0" value="0x4"/>
        <value caption="IS07816 Protocol: T = 1" name="IS07816_T_1" value="0x6"/>
        <value caption="IrDA" name="IRDA" value="0x8"/>
        <value caption="LIN Host mode" name="LIN_MASTER" value="0xA"/>
        <value caption="LIN Client mode" name="LIN_SLAVE" value="0xB"/>
        <value caption="16-bit data host" name="DATA16BIT_MASTER" value="0xC"/>
        <value caption="16-bit data client" name="DATA16BIT_SLAVE" value="0xD"/>
      </value-group>
      <value-group caption="Clock Selection" name="FLEX_US_MR__USCLKS">
        <value caption="Peripheral clock is selected" name="MCK" value="0x0"/>
        <value caption="Peripheral clock divided (DIV = 8) is selected" name="DIV" value="0x1"/>
        <value caption="PMC generic clock is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1." name="GCLK" value="0x2"/>
        <value caption="External pin SCK is selected" name="SCK" value="0x3"/>
      </value-group>
      <value-group caption="Character Length" name="FLEX_US_MR__CHRL">
        <value caption="Character length is 5 bits" name="5_BIT" value="0x0"/>
        <value caption="Character length is 6 bits" name="6_BIT" value="0x1"/>
        <value caption="Character length is 7 bits" name="7_BIT" value="0x2"/>
        <value caption="Character length is 8 bits" name="8_BIT" value="0x3"/>
      </value-group>
      <value-group caption="Parity Type" name="FLEX_US_MR__PAR">
        <value caption="Even parity" name="EVEN" value="0x0"/>
        <value caption="Odd parity" name="ODD" value="0x1"/>
        <value caption="Parity forced to 0 (Space)" name="SPACE" value="0x2"/>
        <value caption="Parity forced to 1 (Mark)" name="MARK" value="0x3"/>
        <value caption="No parity" name="NO" value="0x4"/>
        <value caption="Multidrop mode" name="MULTIDROP" value="0x6"/>
      </value-group>
      <value-group caption="Number of Stop Bits" name="FLEX_US_MR__NBSTOP">
        <value caption="1 stop bit" name="1_BIT" value="0x0"/>
        <value caption="1.5 stop bit (SYNC = 0) or reserved (SYNC = 1)" name="1_5_BIT" value="0x1"/>
        <value caption="2 stop bits" name="2_BIT" value="0x2"/>
      </value-group>
      <value-group caption="Channel Mode" name="FLEX_US_MR__CHMODE">
        <value caption="Normal mode" name="NORMAL" value="0x0"/>
        <value caption="Automatic Echo. Receiver input is connected to the TXD pin." name="AUTOMATIC" value="0x1"/>
        <value caption="Local Loopback. Transmitter output is connected to the Receiver Input." name="LOCAL_LOOPBACK" value="0x2"/>
        <value caption="Remote Loopback. RXD pin is internally connected to the TXD pin." name="REMOTE_LOOPBACK" value="0x3"/>
      </value-group>
