Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX5112MTSH128.atdf
        <register caption="Calendar Register" name="RTC_CALR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Current Century" mask="0x0000007F" name="CENT"/>
          <bitfield caption="Current Year" mask="0x0000FF00" name="YEAR"/>
          <bitfield caption="Current Month" mask="0x001F0000" name="MONTH"/>
          <bitfield caption="Current Day in Current Week" mask="0x00E00000" name="DAY"/>
          <bitfield caption="Current Day in Current Month" mask="0x3F000000" name="DATE"/>
        </register>
        <register caption="Time Alarm Register" name="RTC_TIMALR" offset="0x10" rw="RW" size="4">
          <mode name="DEFAULT"/>
          <mode name="UTC_MODE"/>
          <bitfield caption="Second Alarm" mask="0x0000007F" name="SEC" modes="DEFAULT"/>
          <bitfield caption="Second Alarm Enable" mask="0x00000080" name="SECEN" values="RTC_TIMALR__SECEN" modes="DEFAULT"/>
          <bitfield caption="Minute Alarm" mask="0x00007F00" name="MIN" modes="DEFAULT"/>
          <bitfield caption="Minute Alarm Enable" mask="0x00008000" name="MINEN" values="RTC_TIMALR__MINEN" modes="DEFAULT"/>
          <bitfield caption="Hour Alarm" mask="0x003F0000" name="HOUR" modes="DEFAULT"/>
          <bitfield caption="AM/PM Indicator" mask="0x00400000" name="AMPM" modes="DEFAULT"/>
          <bitfield caption="Hour Alarm Enable" mask="0x00800000" name="HOUREN" values="RTC_TIMALR__HOUREN" modes="DEFAULT"/>
          <bitfield caption="UTC_TIME Alarm" mask="0xFFFFFFFF" name="UTC_TIME" modes="UTC_MODE"/>
        </register>
        <register caption="Calendar Alarm Register" name="RTC_CALALR" offset="0x14" rw="RW" size="4">
          <mode name="DEFAULT"/>
          <mode name="UTC_MODE"/>
          <bitfield caption="Month Alarm" mask="0x001F0000" name="MONTH" modes="DEFAULT"/>
          <bitfield caption="Month Alarm Enable" mask="0x00800000" name="MTHEN" values="RTC_CALALR__MTHEN" modes="DEFAULT"/>
          <bitfield caption="Date Alarm" mask="0x3F000000" name="DATE" modes="DEFAULT"/>
          <bitfield caption="Date Alarm Enable" mask="0x80000000" name="DATEEN" values="RTC_CALALR__DATEEN" modes="DEFAULT"/>
          <bitfield caption="UTC Alarm Enable" mask="0x00000001" name="UTCEN" values="RTC_CALALR_UTC_MODE__UTCEN" modes="UTC_MODE"/>
        </register>
        <register caption="Status Register" name="RTC_SR" offset="0x18" rw="R" size="4">
          <bitfield caption="Acknowledge for Update" mask="0x00000001" name="ACKUPD" values="RTC_SR__ACKUPD"/>
          <bitfield caption="Alarm Flag" mask="0x00000002" name="ALARM" values="RTC_SR__ALARM"/>
          <bitfield caption="Second Event" mask="0x00000004" name="SEC" values="RTC_SR__SEC"/>
          <bitfield caption="Time Event" mask="0x00000008" name="TIMEV" values="RTC_SR__TIMEV"/>
          <bitfield caption="Calendar Event" mask="0x00000010" name="CALEV" values="RTC_SR__CALEV"/>
          <bitfield caption="Time and/or Date Free Running Error" mask="0x00000020" name="TDERR" values="RTC_SR__TDERR"/>
        </register>
        <register caption="Status Clear Command Register" name="RTC_SCCR" offset="0x1C" rw="W" size="4">
          <bitfield caption="Acknowledge Clear" mask="0x00000001" name="ACKCLR"/>
          <bitfield caption="Alarm Clear" mask="0x00000002" name="ALRCLR"/>
          <bitfield caption="Second Clear" mask="0x00000004" name="SECCLR"/>
          <bitfield caption="Time Clear" mask="0x00000008" name="TIMCLR"/>
          <bitfield caption="Calendar Clear" mask="0x00000010" name="CALCLR"/>
          <bitfield caption="Time and/or Date Free Running Error Clear" mask="0x00000020" name="TDERRCLR"/>
        </register>
        <register caption="Interrupt Enable Register" name="RTC_IER" offset="0x20" rw="W" size="4">
          <bitfield caption="Acknowledge Update Interrupt Enable" mask="0x00000001" name="ACKEN"/>
          <bitfield caption="Alarm Interrupt Enable" mask="0x00000002" name="ALREN"/>
          <bitfield caption="Second Event Interrupt Enable" mask="0x00000004" name="SECEN"/>
          <bitfield caption="Time Event Interrupt Enable" mask="0x00000008" name="TIMEN"/>
          <bitfield caption="Calendar Event Interrupt Enable" mask="0x00000010" name="CALEN"/>
          <bitfield caption="Time and/or Date Error Interrupt Enable" mask="0x00000020" name="TDERREN"/>
        </register>
        <register caption="Interrupt Disable Register" name="RTC_IDR" offset="0x24" rw="W" size="4">
          <bitfield caption="Acknowledge Update Interrupt Disable" mask="0x00000001" name="ACKDIS"/>
          <bitfield caption="Alarm Interrupt Disable" mask="0x00000002" name="ALRDIS"/>
          <bitfield caption="Second Event Interrupt Disable" mask="0x00000004" name="SECDIS"/>
          <bitfield caption="Time Event Interrupt Disable" mask="0x00000008" name="TIMDIS"/>
          <bitfield caption="Calendar Event Interrupt Disable" mask="0x00000010" name="CALDIS"/>
          <bitfield caption="Time and/or Date Error Interrupt Disable" mask="0x00000020" name="TDERRDIS"/>
        </register>
        <register caption="Interrupt Mask Register" name="RTC_IMR" offset="0x28" rw="R" size="4">
          <bitfield caption="Acknowledge Update Interrupt Mask" mask="0x00000001" name="ACK"/>
          <bitfield caption="Alarm Interrupt Mask" mask="0x00000002" name="ALR"/>
          <bitfield caption="Second Event Interrupt Mask" mask="0x00000004" name="SEC"/>
          <bitfield caption="Time Event Interrupt Mask" mask="0x00000008" name="TIM"/>
          <bitfield caption="Calendar Event Interrupt Mask" mask="0x00000010" name="CAL"/>
          <bitfield caption="Time and/or Date Error Mask" mask="0x00000020" name="TDERR"/>
        </register>
        <register caption="Valid Entry Register" name="RTC_VER" offset="0x2C" rw="R" size="4">
          <bitfield caption="Non-valid Time" mask="0x00000001" name="NVTIM"/>
          <bitfield caption="Non-valid Calendar" mask="0x00000002" name="NVCAL"/>
          <bitfield caption="Non-valid Time Alarm" mask="0x00000004" name="NVTIMALR"/>
          <bitfield caption="Non-valid Calendar Alarm" mask="0x00000008" name="NVCALALR"/>
        </register>
