Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX5112MTSH128.atdf
        <register caption="Bytes Count Register" name="SHA_BCR" offset="0x30" rw="RW" size="4">
          <bitfield caption="Remaining Byte Count Before Auto Padding" mask="0xFFFFFFFF" name="BYTCNT"/>
        </register>
        <register caption="Input Data 0 Register" name="SHA_IDATAR" offset="0x40" rw="W" size="4" count="16">
          <bitfield caption="Input Data" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input/Output Data 0 Register" name="SHA_IODATAR" offset="0x80" rw="RW" size="4" count="16">
          <bitfield caption="Input/Output Data" mask="0xFFFFFFFF" name="IODATA"/>
        </register>
        <register caption="Write Protection Mode Register" name="SHA_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Configuration Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interruption Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Control Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="First Error Report Enable" mask="0x00000010" name="FIRSTE"/>
          <bitfield caption="Action on Abnormal Event Detection" mask="0x00000060" name="ACTION" values="SHA_WPMR__ACTION"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="SHA_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="SHA_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status (cleared on read)" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Clock Glitch Detected (cleared on read)" mask="0x00000002" name="CGD"/>
          <bitfield caption="Internal Sequencer Error (cleared on read)" mask="0x00000004" name="SEQE"/>
          <bitfield caption="Software Control Error (cleared on read)" mask="0x00000008" name="SWE"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
          <bitfield caption="Software Error Type (cleared on read)" mask="0x0F000000" name="SWETYP" values="SHA_WPSR__SWETYP"/>
          <bitfield caption="Software Error Class (cleared on read)" mask="0x80000000" name="ECLASS" values="SHA_WPSR__ECLASS"/>
        </register>
        <register caption="Transmit Pointer Register" name="SHA_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="SHA_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="SHA_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="SHA_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="SHA_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="SHA_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
        <register caption="Write Protection Mode Register" name="SHA_PWPMR" offset="0x128" rw="RW" size="4">
          <bitfield caption="Write Protection Pointer Registers Enable" mask="0x00000001" name="WPPTREN"/>
          <bitfield caption="Write Protection Counter Registers Enable" mask="0x00000002" name="WPCTREN"/>
          <bitfield caption="Write Protection Control Register Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="SHA_PWPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="Start Mode" name="SHA_MR__SMOD">
        <value caption="Manual mode" name="MANUAL_START" value="0x0"/>
        <value caption="Auto mode" name="AUTO_START" value="0x1"/>
        <value caption="SHA_IDATAR0 access only mode (mandatory when DMA is used)" name="IDATAR0_START" value="0x2"/>
      </value-group>
      <value-group caption="Processing Delay" name="SHA_MR__PROCDLY">
        <value caption="SHA processing runtime is the shortest one" name="SHORTEST" value="0"/>
        <value caption="SHA processing runtime is the longest one (reduces the SHA bandwidth requirement, reduces the system bus overload)" name="LONGEST" value="1"/>
      </value-group>
      <value-group caption="SHA Algorithm" name="SHA_MR__ALGO">
        <value caption="SHA1 algorithm processed" name="SHA1" value="0x0"/>
        <value caption="SHA256 algorithm processed" name="SHA256" value="0x1"/>
        <value caption="SHA384 algorithm processed" name="SHA384" value="0x2"/>
        <value caption="SHA512 algorithm processed" name="SHA512" value="0x3"/>
        <value caption="SHA224 algorithm processed" name="SHA224" value="0x4"/>
        <value caption="SHA512/224 algorithm processed" name="SHA512_224" value="0x5"/>
        <value caption="SHA512/256 algorithm processed" name="SHA512_256" value="0x6"/>
        <value caption="HMAC algorithm with SHA1 Hash processed" name="HMAC_SHA1" value="0x8"/>
        <value caption="HMAC algorithm with SHA256 Hash processed" name="HMAC_SHA256" value="0x9"/>
        <value caption="HMAC algorithm with SHA384 Hash processed" name="HMAC_SHA384" value="0xA"/>
        <value caption="HMAC algorithm with SHA512 Hash processed" name="HMAC_SHA512" value="0xB"/>
        <value caption="HMAC algorithm with SHA224 Hash processed" name="HMAC_SHA224" value="0xC"/>
        <value caption="HMAC algorithm with SHA512/224 Hash processed" name="HMAC_SHA512_224" value="0xD"/>
        <value caption="HMAC algorithm with SHA512/256 Hash processed" name="HMAC_SHA512_256" value="0xE"/>
      </value-group>
      <value-group caption="Dual Input Buffer" name="SHA_MR__DUALBUFF">
        <value caption="SHA_IDATARx and SHA_IODATARx cannot be written during processing of previous block." name="INACTIVE" value="0"/>
        <value caption="SHA_IDATARx and SHA_IODATARx can be written during processing of previous block when SMOD value = 2. It speeds up the overall runtime of large files." name="ACTIVE" value="1"/>
      </value-group>
      <value-group caption="Hash Check" name="SHA_MR__CHECK">
        <value caption="No check is performed" name="NO_CHECK" value="0x0"/>
        <value caption="Check is performed with expected hash stored in internal expected hash value registers." name="CHECK_EHV" value="0x1"/>
        <value caption="Check is performed with expected hash provided after the message." name="CHECK_MESSAGE" value="0x2"/>
      </value-group>
      <value-group caption="Action on Abnormal Event Detection" name="SHA_WPMR__ACTION">
        <value caption="No action (stop or clear key) is performed when one of WPVS,CGD,SEQE, or SWE flag is set." name="REPORT_ONLY" value="0x0"/>
        <value caption="If a processing is in progress when the SHA_WPSR.WPVS/SWE event detection occurs, the current processing is ended normally but no other processing is started while a SHA_CR.UNLOCK command is issued." name="LOCK_WPVS_SWE" value="0x1"/>
        <value caption="If a processing is in progress when the SHA_WPSR.CGD/SEQE event detection occurs, the current processing is ended normally but no other processing is started while a SHA_CR.UNLOCK command is issued." name="LOCK_CGD_SEQE" value="0x2"/>
        <value caption="If a processing is in progress when the SHA_WPSR.WPVS/CGD/SEQE/SWE events detection occurs, the current processing is ended normally but no other processing is started while a SHA_CR.UNLOCK command is issued." name="LOCK_ANY_EV" value="0x3"/>
      </value-group>
      <value-group caption="Write Protection Key" name="SHA_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN,WPITEN,WPCREN bits. Always reads as 0." name="PASSWD" value="0x534841"/>
      </value-group>
      <value-group caption="Software Error Type (cleared on read)" name="SHA_WPSR__SWETYP">
        <value caption="A write-only register has been read (Warning)." name="READ_WO" value="0x0"/>
        <value caption="SHA is enabled and a write access has been performed on a read-only register (Warning)." name="WRITE_RO" value="0x1"/>
        <value caption="Access to an undefined address (Warning)." name="UNDEF_RW" value="0x2"/>
        <value caption="SHA is locked and a start command with SHA_CR.START has been performed." name="CTRL_START" value="0x3"/>
        <value caption="SHA is locked and a tentative automatic start has been performed by writing input data registers (SHA_MR.SMOD&gt;0)." name="AUTO_START" value="0x4"/>
        <value caption="SHA is not locked and a start command with SHA_CR.START has been performed whereas Start mode is automatic (SHA_MR.SMOD&gt;0)" name="BAD_START" value="0x5"/>
      </value-group>
      <value-group caption="Software Error Class (cleared on read)" name="SHA_WPSR__ECLASS">
        <value caption="An abnormal access that does not affect system functionality" name="WARNING" value="0"/>
        <value caption="An access is performed into key, input data, control registers while the SHA is performing an encryption/decryption or a start is request by software or DMA while the key is not fully configured." name="ERROR" value="1"/>
      </value-group>
      <value-group caption="Write Protection Key" name="SHA_PWPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation. Always reads as 0." name="PASSWD" value="0x504443"/>
      </value-group>
    </module>
