Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX5112MTSH128.atdf
        <register caption="Interrupt Mask Register" name="TRNG_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Security and/or Safety Event Interrupt Mask" mask="0x00000002" name="SECE"/>
          <bitfield caption="End Of Transfer on Private Key Bus Interrupt Mask" mask="0x00000004" name="EOTPKB"/>
        </register>
        <register caption="Interrupt Status Register" name="TRNG_ISR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Data Ready (cleared on read)" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Security and/or Safety Event (cleared on read)" mask="0x00000002" name="SECE"/>
          <bitfield caption="End Of Transfer on Private Key Bus (cleared on read)" mask="0x00000004" name="EOTPKB"/>
        </register>
        <register caption="Output Data Register" name="TRNG_ODATA" offset="0x50" rw="R" size="4">
          <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
        </register>
        <register caption="Write Protection Mode Register" name="TRNG_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Control Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="First Error Report Enable" mask="0x00000010" name="FIRSTE"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="TRNG_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="TRNG_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status (cleared on read)" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Clock Glitch Detected (cleared on read)" mask="0x00000002" name="CGD"/>
          <bitfield caption="Internal Sequencer Error (cleared on read)" mask="0x00000004" name="SEQE"/>
          <bitfield caption="Software Control Error (cleared on read)" mask="0x00000008" name="SWE"/>
          <bitfield caption="Write Protection Violation Source (cleared on read)" mask="0x00FFFF00" name="WPVSRC"/>
          <bitfield caption="Software Error Type (cleared on read)" mask="0x0F000000" name="SWETYP" values="TRNG_WPSR__SWETYP"/>
          <bitfield caption="Software Error Class (cleared on read)" mask="0x80000000" name="ECLASS" values="TRNG_WPSR__ECLASS"/>
        </register>
      </register-group>
      <value-group caption="Register Write Access Key" name="TRNG_CR__WAKEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0x524E47"/>
      </value-group>
      <value-group caption="Half Rate Enable" name="TRNG_MR__HALFR">
        <value caption="Maximum stream rate provided (1 sample every 84 MCK clock cycles)." name="DISABLED" value="0"/>
        <value caption="Half maximum stream rate provided if the peripheral clock frequency is above 100 MHz (1 sample every 168 MCK clock cycles)." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Key Bus Client" name="TRNG_PKBCR__KSLAVE">
        <value caption="AES" name="AES_ID" value="0"/>
        <value caption="AESB" name="AESB_ID" value="1"/>
      </value-group>
      <value-group caption="Register Write Access Key" name="TRNG_PKBCR__WAKEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0x524B"/>
      </value-group>
      <value-group caption="Write Protection Key" name="TRNG_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of bits WPEN, WPITEN and WPCREN. Always reads as 0." name="PASSWD" value="0x524E47"/>
      </value-group>
      <value-group caption="Software Error Type (cleared on read)" name="TRNG_WPSR__SWETYP">
        <value caption="TRNG is enabled and a write-only register has been read (Warning)." name="READ_WO" value="0x0"/>
        <value caption="TRNG is enabled and a write access has been performed on a read-only register (Warning)." name="WRITE_RO" value="0x1"/>
        <value caption="Access to an undefined address." name="UNDEF_RW" value="0x2"/>
        <value caption="The TRNG_ODATA register was read when TRNG was disabled or TRNG used for private key bus transfer (Error)." name="TRNG_DIS" value="0x3"/>
        <value caption="A write access to TRNG_PKBCR has been attempted during a private key bus transfer (Error)." name="PKB_BUSY" value="0x4"/>
      </value-group>
      <value-group caption="Software Error Class (cleared on read)" name="TRNG_WPSR__ECLASS">
        <value caption="An abnormal access that does not affect system functionality." name="WARNING" value="0"/>
        <value caption="Reading TRNG_ODATA when TRNG was disabled or TRNG used for private key bus transfer. TRNG does not provide a random value. Writing to TRNG_PKBCR while a private key bus transfer is ongoing does not launch a new private key bus transfer." name="ERROR" value="1"/>
      </value-group>
    </module>
    <module caption="Universal Asynchronous Receiver Transmitter" name="UART" id="6418" version="ZA">
      <register-group name="UART">
        <register caption="Control Register" name="UART_CR" offset="0x0000" rw="W" size="4">
          <bitfield caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
          <bitfield caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
          <bitfield caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
          <bitfield caption="Reset Status" mask="0x00000100" name="RSTSTA"/>
          <bitfield caption="Rearm Time-out" mask="0x00000400" name="RETTO"/>
          <bitfield caption="Start Time-out" mask="0x00000800" name="STTTO"/>
          <bitfield caption="Request Clear" mask="0x00001000" name="REQCLR"/>
          <bitfield caption="Optical Logic Sleep Mode Command" mask="0x00004000" name="OPT_SLEEP"/>
        </register>
        <register caption="Mode Register" name="UART_MR" offset="0x0004" rw="RW" size="4">
          <bitfield caption="UART Optical Interface Enable" mask="0x00000001" name="OPT_EN" values="UART_MR__OPT_EN"/>
          <bitfield caption="UART Receive Data Inverted" mask="0x00000002" name="OPT_RXINV" values="UART_MR__OPT_RXINV"/>
          <bitfield caption="UART Modulated Data Inverted" mask="0x00000004" name="OPT_MDINV" values="UART_MR__OPT_MDINV"/>
          <bitfield caption="Optical Demodulation Enable" mask="0x00000008" name="OPT_DMOD" values="UART_MR__OPT_DMOD"/>
          <bitfield caption="Receiver Digital Filter" mask="0x00000010" name="FILTER" values="UART_MR__FILTER"/>
          <bitfield caption="Analog Comparator Enable" mask="0x00000020" name="ACON" values="UART_MR__ACON"/>
          <bitfield caption="Analog Comparator Output Edge Selection" mask="0x000000C0" name="EDGESEL" values="UART_MR__EDGESEL"/>
          <bitfield caption="Optical Link Activity Wake-up Enable" mask="0x00000100" name="OPT_WKUP" values="UART_MR__OPT_WKUP"/>
          <bitfield caption="Parity Type" mask="0x00000E00" name="PAR" values="UART_MR__PAR"/>
          <bitfield caption="Baud Rate Source Clock" mask="0x00001000" name="BRSRCCK" values="UART_MR__BRSRCCK"/>
          <bitfield caption="Channel Mode" mask="0x0000C000" name="CHMODE" values="UART_MR__CHMODE"/>
          <bitfield caption="Optical Link Clock Divider" mask="0x001F0000" name="OPT_CLKDIV"/>
          <bitfield caption="Optical Link Modulation Clock Duty Cycle" mask="0x07000000" name="OPT_DUTY" values="UART_MR__OPT_DUTY"/>
          <bitfield caption="Receive Path Comparator Threshold" mask="0x70000000" name="OPT_CMPTH" values="UART_MR__OPT_CMPTH"/>
        </register>
        <register caption="Interrupt Enable Register" name="UART_IER" offset="0x0008" rw="W" size="4">
          <bitfield caption="Enable RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Enable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Enable End of Receive Transfer Interrupt" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="Enable End of Transmit Interrupt" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Enable Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Enable Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Enable Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Enable Time-out Interrupt" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="Enable TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Enable Buffer Empty Interrupt" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Enable Buffer Full Interrupt" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Enable Comparison Interrupt" mask="0x00008000" name="CMP"/>
          <bitfield caption="Enable Analog Comparator Event Interrupt" mask="0x00010000" name="ACE"/>
        </register>
        <register caption="Interrupt Disable Register" name="UART_IDR" offset="0x000C" rw="W" size="4">
          <bitfield caption="Disable RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Disable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Disable End of Receive Transfer Interrupt" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="Disable End of Transmit Interrupt" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Disable Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Disable Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Disable Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Disable Time-out Interrupt" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="Disable TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Disable Buffer Empty Interrupt" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Disable Buffer Full Interrupt" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Disable Comparison Interrupt" mask="0x00008000" name="CMP"/>
          <bitfield caption="Disable Analog Comparator Event Interrupt" mask="0x00010000" name="ACE"/>
        </register>
